using Microsoft.EntityFrameworkCore;
using System.ComponentModel.DataAnnotations;
using Microsoft.AspNetCore.Mvc;
using Films.Annotations;

namespace Films.Models
{
    public class FilmContext : DbContext
    {
        // Каждое свойство DbSet будет соотноситься с отдельной таблицей в базе данных.
        public DbSet<Film> Films { get; set; }
        public FilmContext(DbContextOptions<FilmContext> options)
            : base(options)
        {
            if (Database.EnsureCreated())
            {
                Films.Add(new Film
                {
                    Name = "Чужий",
                    Genre = "Фантастика",
                    Director = "Рідлі Скотт",
                    ReleaseYear = 1979,
                    PosterPath = "~/Files/Alien.jpg",
                    Description = @"Космічний корабель здійснює вимушену посадку на невідомій планеті. Доки люди лагодять зореліт, 
                                                    загадкова істота, проникає на корабель. Відлетівши з планети моторошний ксеноморф безжально і 
                                                    винахідливо починає знищувати членів екіпажу. У цій різанині вижити зможе лише найсильніший…"
                });
                Films.Add(new Film
                {
                    Name = "Чужий 3",
                    Genre = "Фантастика",
                    Director = "Девід Фінчер",
                    ReleaseYear = 1992,
                    PosterPath = "~/Files/Alien3.jpg",
                    Description = @"Лейтенант Ріплі зазнає аварії та змушена терміново посадити свій зореліт на якусь планету. 
                                    Так вона потрапляє на планету Фіоріна-161, яка є в'язницею суворого режиму. Там утримують 
                                    особливо небезпечних ув'язнених із зайвою Y-хромосомою -чоловіків, схильних до спалахів агресії 
                                    та кримінальних дій. Невдовзі виявляється, що окрім хижих зеків, на планеті-в’язниці з’являється 
                                    ще більш хижий ксеноморф, якого Ріплі привезла із собою..."
                });
                Films.Add(new Film
                {
                    Name = "Зоряні війни: Епізод 3 - Помста ситхів",
                    Genre = "Фантастика",
                    Director = "Джордж Лукас",
                    ReleaseYear = 2005,
                    PosterPath = "~/Files/SW3.jpg",
                    Description = @"Обдарований учень Обі-Ван-Кенобі Енакін Скайуокер опиняється під впливом канцлера Палпатіна, 
                                    якого він з наставником врятували з полону сітхів. За порятунок Енакін був призначений до ради джедаїв, 
                                    однак без присвоєння звання магістра. До того ж, він таємно одружений на Падме Амідалі. Тим часом, генерал Грівус, 
                                    Мейс Вінду та Йода відчувають що галактика на порозі невідворотних змін і слабкі духом починають тягнутись до сильних світу цього…"
                });
                Films.Add(new Film
                {
                    Name = "Зоряні війни: Епізод 6 - Повернення джедая",
                    Genre = "Фантастика",
                    Director = "Джордж Лукас",
                    ReleaseYear = 1983,
                    PosterPath = "~/Files/SW6.jpg",
                    Description = @"Люк Скайуокер повністю змінився з часів своєї першої подорожі на Татуїн з Обі-Ваном Кенобі. Тепер він ходить у всьому чорному, 
                                    практично повністю володіє мистецтвом Джедая, хоча йому і надалі не дає покою його походження. Він знову відправляється на планету 
                                    Татуїн, щоб врятувати свого друга Хана Соло з лап контрабандиста Джабби Хатта. Тим часом, Дарт Вейдер та Імператор Палпатін будують 
                                    нову, другу, «Зірку Смерті». Вирішальна битва наближається невпинно…"
                });
                Films.Add(new Film
                {
                    Name = "Швидкість",
                    Genre = "Трилер",
                    Director = "Жан де Бонт",
                    ReleaseYear = 1994,
                    PosterPath = "~/Files/Speed_movie.jpg",
                    Description = @"Безжальний та схиблений терорист захоплює автобус із людьми та дівчина-водій Енін і ось за мить величезний автобус з дівчиною 
                                    за кермом мчить по трасі в саму годину пік. Якщо стрілка спідометра впаде до 50 миль, машина вибухне. На кону життя десятків 
                                    пасажирів, час невблаганно спливає, і для вирішення цієї проблеми потрібен справжній герой. За справу береться Джек Трейвен, 
                                    талановитий спецпризначенець, готовий холоднокровно розбиратися з негідниками..."
                });
                Films.Add(new Film
                {
                    Name = "Леді-яструб",
                    Genre = "Драма",
                    Director = "Річард Доннер",
                    ReleaseYear = 1985,
                    PosterPath = "~/Files/Ladyhawke.jpg",
                    Description = @"Злий єпископ-чаклун наклав чари на закоханих одне в одного красуню Ізабо та лицаря Етьєна Наваро — «завжди бути разом і ніколи 
                                    не бути разом»: лицар із заходом сонця до сходу перетворюється на вовка, а красуня зі сходу до заходу стає яструбом.
                                    Лицар рятує дрібного злодія-шахрая Філіпа Ґастона «Мишеня», що стає його помічником. Злодюжка Ґастон і старий священик-п'яниця 
                                    Імперіус допомагають зруйнувати магію злого чаклуна."
                });
                Films.Add(new Film
                { 
                    Name = "Форрест Гамп",
                    Genre = "Драма",
                    Director = "Роберт Земекіс",
                    ReleaseYear = 1994,
                    PosterPath = "~/Files/Forrest Gump.jpg",
                    Description = @"Форрест з дитинства був дивним, дурнуватим, але слухняним і добрим. Таким він і виріс: чуйним і благородним. В юності його відвідала любов, але більше ніж братом для цієї дівчини він бути не може, адже для неї - він всього лише добродушний дурник.

                                    В цей час розпочався призов на війну. Форрест потрапив до В'єтнаму. І це розділило їх, але Гамп не забув про свою кохану і писав листи, де описував їй все, що бачить і відбувається в його житті, про свої думки. Форресту пощастило - він не загинув, але крім цього він знайшов друзів, а дружбою його ніхто і ніколи не нагороджував.

                                    У нього ще попереду довгий шлях і безліч перемог, а в досягненні поставлених цілей він невтомний. І, може бути, йому вдасться завоювати його єдине кохання?"
                });
                Films.Add(new Film
                {
                    Name = "Мовчання ягнят",
                    Genre = "Трилер",
                    Director = "Джонатан Демме",
                    ReleaseYear = 1991,
                    PosterPath = "~/Files/Silence of the Lambs.jpg",
                    Description = @"Кримінальний детектив «Мовчання ягнят» знятий за однойменним романом американського письменника Томаса Харріса.
                                    На Середньому Заході США бешкетує серійний маніяк. Він викрадає жінок, а після того як вбиває, здирає з них шкіру, 
                                    за що його прозвали «Буффало Білл». ФБР робить все можливе, щоб зупинити злочинця, проте, їм не вдається знайти ні 
                                    однієї зачіпки, яка допомогла б вийти на його слід. У світлі ситуації, що склалася, вони вирішують звернутися за 
                                    допомогою до небезпечного вбивці Ганнібала Лектора, який нині відбуває ув'язнення в одній з психіатричних лікарень. 
                                    До цієї справи залучають молоду стажерку Кларису Старлінг. Лектор погоджується допомогти, але тільки за однієї умови: 
                                    дівчина повинна посвятити його в подробиці свого життя. Через брак вибору, Кларисі не залишається нічого іншого, як 
                                    піти назустріч. Але чи буде виправданий такий ризик?"
                });
                Films.Add(new Film
                {
                    Name = "Термінал",
                    Genre = "Драма",
                    Director = "Стівен Спілберґ",
                    ReleaseYear = 2004,
                    PosterPath = "~/Files/The Terminal.jpg",
                    Description = @"Віктор Наворський прилетів в Америку, щоб виконати останнє бажання померлого батька. Але поки він був на борту літака, в 
                                    його рідній Кракозії трапився державний переворот, що призвів за собою анулювання візи.
                                    Віктор опинився в скрутному становищі, не маючи можливості покинути проміжну зону - термінал аеропорту.
                                    Начальник служби безпеки Френк Діксон хоче скоріше позбутися від виниклої проблеми, але Наворський не планує просити 
                                    політичного притулку або порушувати закон, а лише ці два пункти можуть зрушити справу з мертвої точки.
                                    Будучи під охороною Діксона, герой знаходить масу способів виживання без знайомих, грошей і знання мови. Його доброта, 
                                    щирість і позитивний настрій у своєму розпорядженні навколишнім. Згодом Віктор стає улюбленцем співробітників аеропорту, 
                                    продавців і пасажирів. Але він не забуває про мету своєї подорожі і сподівається все-таки потрапити на вулиці Нью-Йорка."
                });
                Films.Add(new Film
                {
                    Name = "Мої думки тихі",
                    Genre = "Комедія",
                    Director = "Антоніо Лукіч",
                    ReleaseYear = 2019,
                    PosterPath = "~/Files/Мої_думки_тихі.jpg",
                    Description = @"Мої думки тихі — українська трагікомедія 2019 року українського режисера Антоніо Лукіча, для якого вона стала дебютною 
                                    повнометражною художньою стрічкою. За сценарієм молодий звукорежисер і невдаха Вадим отримує замовлення від клієнта з 
                                    Канади з проханням записати голоси рідкісних тварин та пташок української фауни Закарпаття, однак завдання ускладнюється тим,
                                    що в подорож по Закарпаттю разом із Вадимом вирушає його мати-таксистка."
                });
                this.SaveChanges();
            }

        }
    }
    public class Film
    {
        // Ідентифікатор фільму
        public int Id { get; set; }

        // Назва фільму
        [Required(ErrorMessage = "Поле обов'язкове для заповнення")]
        [Display(Name = "Назва фільму")]
        public string? Name { get; set; }

        // Ім'я режисера
        [Required(ErrorMessage = "Поле обов'язкове для заповнення")]
        [Display(Name = "Режисер")]
        public string? Director { get; set; }

        // Рік випуску фільму
        [Required(ErrorMessage = "Поле обов'язкове для заповнення")]
        [Display(Name = "Рік випуску")]
        [MyReleaseYear(ErrorMessage = "Неправильно вказаний рік випуску")]
        public int ReleaseYear { get; set; }

        // Жанр фільму
        [Required(ErrorMessage = "Поле обов'язкове для заповнення")]
        [MyGenres(new string[] {"Комедія","Історичний", "Мелодрама",
                                "Драма", "Документальний", "Пригодницький",
                                "Бойовик", "Фантастика", "Трилер", "Жахи", "Містика" },
                  ErrorMessage = "Неправильно вказаний жанр фільму")]
        [Display(Name = "Жанр фільму")]
        public string? Genre { get; set; }

        // Постер фільму
        //[Required(ErrorMessage = "Поле обов'язкове для заповнення")]
        [Display(Name = "Постер")]
        public string? PosterPath { get; set; }

        // Опис фільму
        [Required(ErrorMessage = "Поле обов'язкове для заповнення")]
        [Display(Name = "Опис фільму")]
        public string? Description { get; set; }
    }
}
